Дошкольное_учреждение83/src/Enums/удуСтатусОтправки/удуСтатусОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСтатусОтправки</name>
  <enumValues>
    <name>Текущий</name>
  </enumValues>
  <enumValues>
    <name>Закрытый</name>
  </enumValues>
  <enumValues>
    <name>Отправленный</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуРеестрыОтправки/удуРеестрыОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуРеестрыОтправки</name>
  <attributes>
    <name>ТипРеестра</name>
    <type>
      <types>CatalogRef.удуТипыРеестров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.удуСтатусОтправки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ИсходящиеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПакета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовторныеПакеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/CommonForms/удуВыборЗакрытогоРеестра/Module.bsl
&НаКлиенте
Процедура ЗаписатьРеестр(Команда)
	Если СписокЗакрытыеРеестры.Количество() > 0 Тогда
		Если Элементы.СписокЗакрытыеРеестры.ВыделенныеСтроки.Количество() > 0 Тогда 
			ВыбранныйРеестр = Элементы.СписокЗакрытыеРеестры.ТекущиеДанные.ЗакрытыйРеестр;
			Закрыть(ВыбранныйРеестр);	
		Иначе
			Вопрос("Реестр не выбран.",РежимДиалогаВопрос.ОК);
		КонецЕсли;
	Иначе
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗакрытыхРеестров()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	удуРеестрыОтправки.Ссылка,
	|	удуРеестрыОтправки.ДатаЗакрытия
	|ИЗ
	|	Справочник.удуРеестрыОтправки КАК удуРеестрыОтправки
	|ГДЕ
	|	удуРеестрыОтправки.Статус = &Статус
	|	И удуРеестрыОтправки.ТипРеестра.СпособОтправки = &ВидДоставки");
	
	Запрос.УстановитьПараметр("Статус",Перечисления.удуСтатусОтправки.Закрытый);
	Запрос.УстановитьПараметр("ВидДоставки",ВидДоставки);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаТЧ = СписокЗакрытыеРеестры.Добавить();	
		НоваяСтрокаТЧ.ЗакрытыйРеестр = Выборка.Ссылка;
		НоваяСтрокаТЧ.ДатаЗакрытия = Выборка.ДатаЗакрытия;
	КонецЦикла;
	
	
КонецПроцедуры // СформироватьСписокЗакрытыхРеестров()

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	СписокЗакрытыеРеестры.Очистить();
	СформироватьСписокЗакрытыхРеестров();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры
